$ python3 -m repl
> (head: [())]
()
> head
{())
> {1, 2} head
1
> (tail: [(), ())]
()
> tail
{(), ())
> {3, 4} tail
4
> {3, {4, 5}} tail head
4
> x (y>
x
> x (y> <())
y
> x (y, z> <(), ()}
{y, z}
